xml/InformationRegisters/ИИА_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ИИА_НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Provider_BaseUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Provider_ApiKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитТокеновНаЗапуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКЛогуОтладки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/Enums/ИИА_ТипДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ИИА_ТипДиалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспознаваниеДокументов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_АвторСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИИА_АвторСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Система</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Catalogs/ИИА_Диалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИИА_Диалоги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДиалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИИА_ТипДиалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОркестраторВключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИИА_АвторСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСообщения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИИА_ТипСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстКода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UsageTokens</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусDSL</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИИА_СтатусDSL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОбъект</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

xml/CommonModules/ИИА_ДиалогCOM/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПодготовитьЛимитТокеновДляСинхронногоПрогона(Пользователь, МинимальныйЛимит = 50000)
	СостояниеЛимита = Новый Структура("НужноВосстановить,ЛимитБыло", Ложь, Неопределено);
	
	НаборЗаписей = РегистрыСведений.ИИА_НастройкиПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Пользователь = Пользователь;
		Запись.ЛимитТокеновНаЗапуск = МинимальныйЛимит;
		НаборЗаписей.Записать();
		СостояниеЛимита.НужноВосстановить = Истина;
		СостояниеЛимита.ЛимитБыло = 0;
		Возврат СостояниеЛимита;
	КонецЕсли;
	
	Запись = НаборЗаписей[0];
	ТекущийЛимит = Запись.ЛимитТокеновНаЗапуск;
	СостояниеЛимита.ЛимитБыло = ТекущийЛимит;
	
	Если ТекущийЛимит > 0 И ТекущийЛимит < МинимальныйЛимит Тогда
		Запись.ЛимитТокеновНаЗапуск = МинимальныйЛимит;
		НаборЗаписей.Записать();
		СостояниеЛимита.НужноВосстановить = Истина;
	КонецЕсли;
	
	Возврат СостояниеЛимита;
КонецФункции

Процедура ВосстановитьЛимитТокеновПослеСинхронногоПрогона(Пользователь, СостояниеЛимита)
	Если СостояниеЛимита = Неопределено
		ИЛИ НЕ СостояниеЛимита.Свойство("НужноВосстановить")
		ИЛИ НЕ СостояниеЛимита.НужноВосстановить Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИИА_НастройкиПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запись = НаборЗаписей[0];
	Запись.ЛимитТокеновНаЗапуск = СостояниеЛимита.ЛимитБыло;
	НаборЗаписей.Записать();
КонецПроцедуры

// Создаёт диалог, отправляет сообщение и выполняет оркестратор синхронно (для COM/автотестов).
//
// Параметры:
//  Пользователь - Строка - имя пользователя (например, "Администратор")
//  ТекстЗадачи - Строка - текст задачи для агента
//  ТипДиалога - ПеречислениеСсылка.ИИА_ТипДиалога - Агент или Запрос1С (по умолчанию Агент)
//  ВыполнятьБезПодтверждения - Булево - включить режим без интерактивного approval для write-flow тестов
//
// Возвращаемое значение:
//  Структура:
//   * СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на созданный диалог
//   * Успех - Булево - успешность выполнения
//   * Лог - Строка - полный лог диалога
//   * Сообщения - Массив - массив структур с сообщениями (Время, Автор, Текст, ТекстКода)
//   * UsageTokens - Число - количество использованных токенов (для учёта стоимости)
//
Функция СоздатьДиалогИВыполнитьАгентаСинхронно(Пользователь, ТекстЗадачи, ТипДиалога = Неопределено, ВыполнятьБезПодтверждения = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СсылкаДиалога", Неопределено);
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("Лог", "");
	Результат.Вставить("Сообщения", Новый Массив);
	Результат.Вставить("UsageTokens", 0);
	СостояниеЛимита = Неопределено;
	
	Попытка
		
		// По умолчанию - Агент
		Если ТипДиалога = Неопределено Тогда
			ТипДиалога = Перечисления.ИИА_ТипДиалога.Агент;
		КонецЕсли;
		
		// Для COM/e2e-прогонов не даём низкому пользовательскому лимиту
		// остановить сценарий до фактического завершения.
		СостояниеЛимита = ПодготовитьЛимитТокеновДляСинхронногоПрогона(Пользователь);
		
		// 1. Создаём диалог
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог(Пользователь, ТипДиалога);
		Результат.СсылкаДиалога = СсылкаДиалога;
		
		// 2. Отправляем сообщение (добавит в диалог, очистит план, для Агента/Запрос1С вернёт "Запрос принят")
		ИИА_Сервер.ОтправитьСообщениеСервера(СсылкаДиалога, ТипДиалога, ТекстЗадачи);
		
		// 3. Включаем оркестратор (как при нажатии "Отправить" в форме агента)
		ИИА_Сервер.УстановитьОркестраторВключен(СсылкаДиалога, Истина);
		Если ВыполнятьБезПодтверждения Тогда
			ИИА_Сервер.УстановитьРежимБезПодтверждения(СсылкаДиалога, Истина);
		КонецЕсли;
		ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Оркестратор] Запуск серверного движка...");
		
		// 4. Выполняем цикл оркестратора синхронно (без ФоновыеЗадания)
		НачальныеТокены = ИИА_Сервер.ПолучитьОбщееКоличествоТокенов(СсылкаДиалога);
		ИИА_Оркестратор.ВыполнитьЦикл(СсылкаДиалога, НачальныеТокены);
		
		// 5. Собираем лог
		Результат.Лог = ИИА_Сервер.ПолучитьЛогДиалога(СсылкаДиалога);
		
		// 6. Собираем сообщения
		МассивСообщений = ИИА_Сервер.ПолучитьСообщенияДиалога(СсылкаДиалога, 0);
		Для Каждого СтруктураСообщения Из МассивСообщений Цикл
			Результат.Сообщения.Добавить(СтруктураСообщения);
		КонецЦикла;
		
		// Успех - если оркестратор дошел до конца без критической ошибки
		Результат.Успех = НЕ ИИА_Сервер.ОркестраторВключенДляДиалога(СсылкаДиалога);
		
		// UsageTokens - для учёта стоимости (Gitsell: 400 руб / 1 800 000 токенов)
		Результат.UsageTokens = ИИА_Сервер.ПолучитьОбщееКоличествоТокенов(СсылкаДиалога);
		
	Исключение
		Результат.Лог = Результат.Лог + Символы.ПС + "[ОШИБКА] " + ОписаниеОшибки();
	КонецПопытки;
	
	Попытка
		ВосстановитьЛимитТокеновПослеСинхронногоПрогона(Пользователь, СостояниеЛимита);
	Исключение
		Результат.Лог = Результат.Лог + Символы.ПС + "[ОШИБКА ВОССТАНОВЛЕНИЯ ЛИМИТА] " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьBridgeСессию(Пользователь, ТипДиалога = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("СсылкаДиалога", Неопределено);
	Результат.Вставить("SessionId", "");
	Результат.Вставить("Сообщение", "");
	
	Попытка
		Если ТипДиалога = Неопределено Тогда
			ТипДиалога = Перечисления.ИИА_ТипДиалога.Агент;
		КонецЕсли;
		
		СсылкаДиалога = ИИА_Сервер.СоздатьНовыйДиалог(Пользователь, ТипДиалога);
		Результат.СсылкаДиалога = СсылкаДиалога;
		Результат.SessionId = Строка(СсылкаДиалога.УникальныйИдентификатор());
		Результат.Успех = Истина;
		Результат.Сообщение = "Bridge session created";
	Исключение
		Результат.Сообщение = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоследнийОтветИИИзМассиваСообщений(МассивСообщений)
	
	Если МассивСообщений = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Для Индекс = МассивСообщений.Количество() - 1 По 0 Цикл
		СтруктураСообщения = МассивСообщений[Индекс];
		Если СтруктураСообщения.Автор = Перечисления.ИИА_АвторСообщения.ИИ Тогда
			Если НЕ ПустаяСтрока(СтруктураСообщения.Текст) Тогда
				Возврат СтруктураСообщения.Текст;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ВыполнитьХодBridge(SessionId, ТекстСообщения) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("СсылкаДиалога", Неопределено);
	Результат.Вставить("SessionId", SessionId);
	Результат.Вставить("Лог", "");
	Результат.Вставить("Сообщения", Новый Массив);
	Результат.Вставить("ОтветАссистента", "");
	Результат.Вставить("UsageTokens", 0);
	СостояниеЛимита = Неопределено;
	
	Попытка
		СсылкаДиалога = Неопределено;
		Попытка
			СсылкаДиалога = Новый УникальныйИдентификатор(SessionId);
		Исключение
		КонецПопытки;
		
		Если ТипЗнч(СсылкаДиалога) = Тип("УникальныйИдентификатор") Тогда
			СсылкаДиалога = Справочники.ИИА_Диалоги.ПолучитьСсылку(СсылкаДиалога);
		Иначе
			СсылкаДиалога = Неопределено;
		КонецЕсли;
		
		Если СсылкаДиалога = Неопределено ИЛИ СсылкаДиалога.Пустая() Тогда
			ВызватьИсключение "Bridge session not found: " + SessionId;
		КонецЕсли;
		
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		СостояниеЛимита = ПодготовитьЛимитТокеновДляСинхронногоПрогона(Диалог.Пользователь);
		
		ИИА_Сервер.ОтправитьСообщениеСервера(СсылкаДиалога, Диалог.ТипДиалога, ТекстСообщения);
		ИИА_Сервер.УстановитьОркестраторВключен(СсылкаДиалога, Истина);
		ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[Bridge] Выполнение очередного хода session-mode...");
		
		НачальныеТокены = ИИА_Сервер.ПолучитьОбщееКоличествоТокенов(СсылкаДиалога);
		ИИА_Оркестратор.ВыполнитьЦикл(СсылкаДиалога, НачальныеТокены);
		
		Результат.СсылкаДиалога = СсылкаДиалога;
		Результат.SessionId = Строка(СсылкаДиалога.УникальныйИдентификатор());
		Результат.Лог = ИИА_Сервер.ПолучитьЛогДиалога(СсылкаДиалога);
		Результат.Сообщения = ИИА_Сервер.ПолучитьСообщенияДиалога(СсылкаДиалога, 0);
		Результат.ОтветАссистента = ПолучитьПоследнийОтветИИИзМассиваСообщений(Результат.Сообщения);
		Результат.UsageTokens = ИИА_Сервер.ПолучитьОбщееКоличествоТокенов(СсылкаДиалога);
		Результат.Успех = НЕ ИИА_Сервер.ОркестраторВключенДляДиалога(СсылкаДиалога);
	Исключение
		Результат.Лог = Результат.Лог + Символы.ПС + "[ОШИБКА] " + ОписаниеОшибки();
	КонецПопытки;
	
	Попытка
		Если Результат.СсылкаДиалога <> Неопределено Тогда
			Диалог = Результат.СсылкаДиалога.ПолучитьОбъект();
			ВосстановитьЛимитТокеновПослеСинхронногоПрогона(Диалог.Пользователь, СостояниеЛимита);
		КонецЕсли;
	Исключение
		Результат.Лог = Результат.Лог + Символы.ПС + "[ОШИБКА ВОССТАНОВЛЕНИЯ ЛИМИТА] " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ЗакрытьBridgeСессию(SessionId) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("SessionId", SessionId);
	Результат.Вставить("Сообщение", "");
	
	Попытка
		Результат.Успех = Истина;
		Результат.Сообщение = "Bridge session closed";
	Исключение
		Результат.Сообщение = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
